alpri0265/STM32F407ZET6-MODUL-1/Src/jog.c
#include "jog.h"
#include "main.h"
#include "board.h"
#include "adc_if.h"
#include "bringup_config.h"
#include "menu.h"
#include "system_config.h"
#include "sl_limits.h"
#include <stdint.h>
#include <stdbool.h>

#if BRINGUP_MODE

/* Підключення до драйвера (DM556): PUL = STEP, DIR = напрямок, ENA = дозвіл.
   В main.h: X — PA8=PUL, PA9=DIR, PA10=ENA; Z — PB6=PUL, PB7=DIR, PB8=ENA. */
#define JOG_STEP_PERIOD_MS       4u  /* мс між кроками (база) — більший діапазон для rapid */
#define JOG_STEP_PERIOD_RAPID_MS 1u  /* мс при rapid — завжди 2–4× швидше */
/* Feed override: ADC 0..4095 → scale 50..150%. period = base*100/scale, min 1 ms */
#define JOG_PULSE_CYCLES    500u   /* тривалість імпульсу ~3 µs при 168 MHz (DM556: min 2.5 µs) */
#define JOG_DIR_SETTLE      400u   /* циклів після DIR перед STEP (~2.4 µs) */
#define SL_OSC_HYST_MM      1.0f   /* гістерезис при розвороті (мм) — уникнути вібрації */
#define SL_OSC_MIN_RANGE_MM 2.0f   /* мін. відстань між лімітами для авто-коливань */

/* 1 = імпульс кроку активний по LOW (idle HIGH, pulse LOW); 0 = активний по HIGH */
#define STEP_PULSE_ACTIVE_LOW  0
/* 1 = ENA по HIGH увімкнено; 0 = ENA по LOW увімкнено */
#define ENA_ACTIVE_HIGH        1
/* 1 = постійні кроки X/Z без джойстика (тест); 0 = рух тільки від джойстика */
#define JOG_ALWAYS_RUN_TEST    0
/* Кнопка пришвидшеної подачі: використовуємо SCALE_0 (PC0). Натиснуто = LOW (на землю). */
#define RAPID_BTN_GPIO_Port    SCALE_0_GPIO_Port
#define RAPID_BTN_Pin          SCALE_0_Pin
#define RAPID_BTN_ACTIVE_LOW   1

static volatile uint32_t s_isr_tick;   /* +1 кожні 1 ms від TIM6 — рівномірний таймінг */
static uint32_t s_last_step_tick;
static volatile uint8_t s_manual_mode; /* 1 = ручна подача (ISR крокує), 0 = Feed Auto (ISR крокує ліміт→ліміт) */
static volatile uint8_t s_limit_block; /* 0x1=-X 0x2=+X 0x4=-Z 0x8=+Z — блокування руху */
static uint32_t s_step_count_x;
static uint32_t s_step_count_z;
/* Підписані позиції в кроках для програмних лімітів */
static int32_t s_pos_x_steps;
static int32_t s_pos_z_steps;
static uint16_t s_feed_override_cached = 2048u;  /* 50% по замовчуванню, оновлюється з main loop */
/* Кеш steps_per_mm для ISR (позиція в мм у Feed Auto) */
static float s_steps_per_mm_x = 1.0f;
static float s_steps_per_mm_z = 1.0f;
static int s_feed_auto_x_dir = 1;
static int s_feed_auto_z_dir = 1;
/* Z: скільки проходів між лімітами (0 = без обмежень). */
static volatile uint8_t s_z_passes_requested = 0u;
static volatile uint16_t s_z_reversal_count = 0u;
/* X: кількість проходів (0 = без обмежень). Крок заглиблення 0.01..0.3 mm (індекс 0..29) — після кожного повного проходу по Z вісь X зміщується на цей крок у напрямку X- (принцип токарного станка). */
static volatile uint8_t s_x_passes_requested = 0u;
static volatile uint16_t s_x_reversal_count = 0u;
static volatile uint8_t s_x_step_per_pass_index = 0u;  /* 0..29 → 0.01, 0.02, ... 0.30 mm */
static volatile int32_t s_z_pass_x_pending_steps = 0;  /* X кроків у напрямку X- після проходу Z (дренуємо по одному за тик) */

static void step_pulse_delay(void)
{
    for (volatile uint32_t i = 0u; i < JOG_PULSE_CYCLES; i++) (void)0;
}

static void dir_settle_delay(void)
{
    for (volatile uint32_t i = 0u; i < JOG_DIR_SETTLE; i++) (void)0;
}

static bool rapid_pressed(void)
{
    GPIO_PinState s = HAL_GPIO_ReadPin(RAPID_BTN_GPIO_Port, RAPID_BTN_Pin);
    if (RAPID_BTN_ACTIVE_LOW)
        return (s == GPIO_PIN_RESET);
    else
        return (s == GPIO_PIN_SET);
}

static void pulse_x_step(int dir)
{
#if STEP_PULSE_ACTIVE_LOW
    HAL_GPIO_WritePin(X_STEP_GPIO_Port, X_STEP_Pin, GPIO_PIN_RESET);
    step_pulse_delay();
    HAL_GPIO_WritePin(X_STEP_GPIO_Port, X_STEP_Pin, GPIO_PIN_SET);
#else
    HAL_GPIO_WritePin(X_STEP_GPIO_Port, X_STEP_Pin, GPIO_PIN_SET);
    step_pulse_delay();
    HAL_GPIO_WritePin(X_STEP_GPIO_Port, X_STEP_Pin, GPIO_PIN_RESET);
#endif
    s_step_count_x++;
    s_pos_x_steps += dir;
}

static void pulse_z_step(int dir)
{
#if STEP_PULSE_ACTIVE_LOW
    HAL_GPIO_WritePin(z_STEP_GPIO_Port, z_STEP_Pin, GPIO_PIN_RESET);
    step_pulse_delay();
    HAL_GPIO_WritePin(z_STEP_GPIO_Port, z_STEP_Pin, GPIO_PIN_SET);
#else
    HAL_GPIO_WritePin(z_STEP_GPIO_Port, z_STEP_Pin, GPIO_PIN_SET);
    step_pulse_delay();
    HAL_GPIO_WritePin(z_STEP_GPIO_Port, z_STEP_Pin, GPIO_PIN_RESET);
#endif
    s_step_count_z++;
    s_pos_z_steps += dir;
}

void jog_init(void)
{
    s_isr_tick = 0u;
    s_last_step_tick = 0u;
    s_manual_mode = 1u;
    s_pos_x_steps = 0;
    s_pos_z_steps = 0;
    {
        const axis_cfg_t *cx = system_axis_cfg(AXIS_X);
        const axis_cfg_t *cz = system_axis_cfg(AXIS_Z);
        s_steps_per_mm_x = (cx->steps_per_mm > 0.0f) ? cx->steps_per_mm : 1.0f;
        s_steps_per_mm_z = (cz->steps_per_mm > 0.0f) ? cz->steps_per_mm : 1.0f;
    }
    /* STEP (PUL) — переводимо з AF TIM1/TIM4 у звичайний вихід GPIO */
    GPIO_InitTypeDef g = {0};
    g.Mode = GPIO_MODE_OUTPUT_PP;
    g.Pull = GPIO_NOPULL;
    g.Speed = GPIO_SPEED_FREQ_HIGH;
    g.Pin = X_STEP_Pin;
    HAL_GPIO_Init(X_STEP_GPIO_Port, &g);
    g.Pin = z_STEP_Pin;
    HAL_GPIO_Init(z_STEP_GPIO_Port, &g);
#if STEP_PULSE_ACTIVE_LOW
    HAL_GPIO_WritePin(X_STEP_GPIO_Port, X_STEP_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(z_STEP_GPIO_Port, z_STEP_Pin, GPIO_PIN_SET);
#else
    HAL_GPIO_WritePin(X_STEP_GPIO_Port, X_STEP_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(z_STEP_GPIO_Port, z_STEP_Pin, GPIO_PIN_RESET);
#endif
#if ENA_ACTIVE_HIGH
    HAL_GPIO_WritePin(X_EN_GPIO_Port, X_EN_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(Z_EN_GPIO_Port, Z_EN_Pin, GPIO_PIN_SET);
#else
    HAL_GPIO_WritePin(X_EN_GPIO_Port, X_EN_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(Z_EN_GPIO_Port, Z_EN_Pin, GPIO_PIN_RESET);
#endif

    /* Кнопка Rapid (SCALE_0 / PC0): вхід з підтяжкою вгору, натиснуто = до GND. */
    GPIO_InitTypeDef b = {0};
    b.Pin = RAPID_BTN_Pin;
    b.Mode = GPIO_MODE_INPUT;
    b.Pull = GPIO_PULLUP;
    b.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(RAPID_BTN_GPIO_Port, &b);
}

