alpri0265/STM32F407ZET6-MODUL-1/Src/jog.c
/* 1 = рух від джойстика (JOY_UP/DOWN/LEFT/RIGHT), 0 = рух від кнопок меню */
#define JOG_USE_JOYSTICK 1

#if JOG_USE_JOYSTICK
/* 1 = натиснуто коли пін LOW, 0 = натиснуто коли пін HIGH. За показами U/D/L/R на екрані Jog */
#define JOY_UP_ACTIVE_LOW    1
#define JOY_DOWN_ACTIVE_LOW  1
#define JOY_LEFT_ACTIVE_LOW  1
#define JOY_RIGHT_ACTIVE_LOW 1
static bool joy_up(void)    { return (HAL_GPIO_ReadPin(JOY_UP_GPIO_Port, JOY_UP_Pin) == GPIO_PIN_RESET) == (JOY_UP_ACTIVE_LOW != 0); }
static bool joy_down(void)  { return (HAL_GPIO_ReadPin(JOY_DOWN_GPIO_Port, JOY_DOWN_Pin) == GPIO_PIN_RESET) == (JOY_DOWN_ACTIVE_LOW != 0); }
static bool joy_left(void)  { return (HAL_GPIO_ReadPin(JOY_LEFT_GPIO_Port, JOY_LEFT_Pin) == GPIO_PIN_RESET) == (JOY_LEFT_ACTIVE_LOW != 0); }
static bool joy_right(void) { return (HAL_GPIO_ReadPin(JOY_RIGHT_GPIO_Port, JOY_RIGHT_Pin) == GPIO_PIN_RESET) == (JOY_RIGHT_ACTIVE_LOW != 0); }

void jog_get_joy_state(unsigned int *up, unsigned int *down, unsigned int *left, unsigned int *right)
{
    if (up)   *up   = joy_up()   ? 1u : 0u;
    if (down) *down = joy_down() ? 1u : 0u;
    if (left) *left = joy_left() ? 1u : 0u;
    if (right) *right = joy_right() ? 1u : 0u;
}

void jog_get_step_counts(uint32_t *x, uint32_t *z)
{
    if (x) *x = s_step_count_x;
    if (z) *z = s_step_count_z;
}

void jog_get_pos_mm(float *x_mm, float *z_mm)
{
    const axis_cfg_t *cx = system_axis_cfg(AXIS_X);
    const axis_cfg_t *cz = system_axis_cfg(AXIS_Z);
    if (x_mm) *x_mm = (float)s_pos_x_steps / (cx->steps_per_mm > 0.0f ? cx->steps_per_mm : 1.0f);
    if (z_mm) *z_mm = (float)s_pos_z_steps / (cz->steps_per_mm > 0.0f ? cz->steps_per_mm : 1.0f);
}

void jog_get_rapid_state(unsigned int *rapid)
{
    if (rapid) *rapid = rapid_pressed() ? 1u : 0u;
}

void jog_set_feed_override(uint16_t raw)
{
    s_feed_override_cached = raw;
}

unsigned int jog_get_z_passes(void)
{
    return (unsigned int)s_z_passes_requested;
}

void jog_set_z_passes(unsigned int n)
{
    s_z_passes_requested = (n > 99u) ? 99u : (uint8_t)n;
}

unsigned int jog_get_x_passes(void)
{
    return (unsigned int)s_x_passes_requested;
}

void jog_set_x_passes(unsigned int n)
{
    s_x_passes_requested = (n > 99u) ? 99u : (uint8_t)n;
}

/* Індекс кроку 0..29 → 0.01, 0.02, ... 0.30 mm */
unsigned int jog_get_x_step_index(void)
{
    return (unsigned int)s_x_step_per_pass_index;
}

void jog_set_x_step_index(unsigned int i)
{
    s_x_step_per_pass_index = (i > 29u) ? 29u : (uint8_t)i;
}

/* Крок заглиблення X в мм за індексом 0..29 (0.01 .. 0.30) */
static float x_step_mm_from_index(unsigned int i)
{
    if (i > 29u) i = 29u;
    return 0.01f * (float)(i + 1u);
}

/* Генерація кроків з TIM6. При s_manual_mode==0 (Feed Auto) тут же робимо кроки ліміт→ліміт. */
void jog_tick_from_isr(void)
{
    s_isr_tick++;

    uint32_t base_ms = rapid_pressed() ? JOG_STEP_PERIOD_RAPID_MS : JOG_STEP_PERIOD_MS;
    uint16_t feed_raw = s_feed_override_cached;
    uint32_t scale = 30u + ((uint32_t)feed_raw * 120u) / 4095u;
    if (scale < 10u) scale = 10u;
    uint32_t period_ms = (base_ms * 100u) / scale;
    if (period_ms < 1u) period_ms = 1u;
    if ((s_isr_tick - s_last_step_tick) < period_ms)
        return;

    if (s_manual_mode == 0u) {
        /* Дренування X-кроків (заглиблення X-) після проходу Z — один крок за тик */
        if (s_z_pass_x_pending_steps > 0) {
            s_last_step_tick = s_isr_tick;
            HAL_GPIO_WritePin(X_DIR_GPIO_Port, X_DIR_Pin, GPIO_PIN_RESET);  /* X- */
            dir_settle_delay();
            pulse_x_step(-1);
            s_z_pass_x_pending_steps--;
            return;
        }

        float xm = (float)s_pos_x_steps / s_steps_per_mm_x;
        float zm = (float)s_pos_z_steps / s_steps_per_mm_z;

        if (joy_up()) {
            if (sl_limits_z_taught()) {
                float lo = sl_limits_get_z_min();
                float hi = sl_limits_get_z_max();
                if (lo > hi) { float t = lo; lo = hi; hi = t; }
                if ((hi - lo) < SL_OSC_MIN_RANGE_MM) {
                    s_last_step_tick = s_isr_tick;
                    return;
                }
                if (s_z_passes_requested != 0u && s_z_reversal_count >= 2u * (uint16_t)s_z_passes_requested) {
                    s_last_step_tick = s_isr_tick;
                    return;  /* задана кількість проходів Z виконана */
                }
                {
                    int old_z = s_feed_auto_z_dir;
                    if (zm >= hi - SL_OSC_HYST_MM) s_feed_auto_z_dir = -1;
                    else if (zm <= lo + SL_OSC_HYST_MM) s_feed_auto_z_dir = 1;
                    if (s_feed_auto_z_dir != old_z) {
                        s_z_reversal_count++;
                        /* Після кожного повного проходу Z (туди-назад) — заглиблення по X на крок (X-) */
                        if (s_z_reversal_count >= 2u && (s_z_reversal_count & 1u) == 0u) {
                            float step_mm = x_step_mm_from_index(s_x_step_per_pass_index);
                            int32_t x_steps = (int32_t)(step_mm * s_steps_per_mm_x + 0.5f);
                            if (x_steps > 0) s_z_pass_x_pending_steps += x_steps;
                        }
                    }
                    s_last_step_tick = s_isr_tick;
                    HAL_GPIO_WritePin(Z_DIR_GPIO_Port, Z_DIR_Pin, s_feed_auto_z_dir > 0 ? GPIO_PIN_SET : GPIO_PIN_RESET);
                    dir_settle_delay();
                    pulse_z_step(s_feed_auto_z_dir);
                }
            } else {
                s_last_step_tick = s_isr_tick;
                HAL_GPIO_WritePin(Z_DIR_GPIO_Port, Z_DIR_Pin, GPIO_PIN_SET);
                dir_settle_delay();
                pulse_z_step(1);
            }
            return;
        }
        if (joy_down()) {
            if (sl_limits_z_taught()) {
                float lo = sl_limits_get_z_min();
                float hi = sl_limits_get_z_max();
                if (lo > hi) { float t = lo; lo = hi; hi = t; }
                if ((hi - lo) < SL_OSC_MIN_RANGE_MM) {
                    s_last_step_tick = s_isr_tick;
                    return;
                }
                if (s_z_passes_requested != 0u && s_z_reversal_count >= 2u * (uint16_t)s_z_passes_requested) {
                    s_last_step_tick = s_isr_tick;
                    return;
                }
                {
                    int old_z = s_feed_auto_z_dir;
                    if (zm >= hi - SL_OSC_HYST_MM) s_feed_auto_z_dir = -1;
                    else if (zm <= lo + SL_OSC_HYST_MM) s_feed_auto_z_dir = 1;
                    if (s_feed_auto_z_dir != old_z) {
                        s_z_reversal_count++;
                        if (s_z_reversal_count >= 2u && (s_z_reversal_count & 1u) == 0u) {
                            float step_mm = x_step_mm_from_index(s_x_step_per_pass_index);
                            int32_t x_steps = (int32_t)(step_mm * s_steps_per_mm_x + 0.5f);
                            if (x_steps > 0) s_z_pass_x_pending_steps += x_steps;
                        }
                    }
                    s_last_step_tick = s_isr_tick;
                    HAL_GPIO_WritePin(Z_DIR_GPIO_Port, Z_DIR_Pin, s_feed_auto_z_dir > 0 ? GPIO_PIN_SET : GPIO_PIN_RESET);
                    dir_settle_delay();
                    pulse_z_step(s_feed_auto_z_dir);
                }
            } else {
                s_last_step_tick = s_isr_tick;
                HAL_GPIO_WritePin(Z_DIR_GPIO_Port, Z_DIR_Pin, GPIO_PIN_RESET);
                dir_settle_delay();
                pulse_z_step(-1);
            }
            return;
        }
        if (joy_left()) {
            if (sl_limits_x_taught()) {
                float lo = sl_limits_get_x_min();
                float hi = sl_limits_get_x_max();
                if (lo > hi) { float t = lo; lo = hi; hi = t; }
                if ((hi - lo) < SL_OSC_MIN_RANGE_MM) {
                    s_last_step_tick = s_isr_tick;
                    return;
                }
                if (s_x_passes_requested != 0u && s_x_reversal_count >= 2u * (uint16_t)s_x_passes_requested) {
                    s_last_step_tick = s_isr_tick;
                    return;
                }
                {
                    int old_x = s_feed_auto_x_dir;
                    if (xm >= hi - SL_OSC_HYST_MM) s_feed_auto_x_dir = -1;
                    else if (xm <= lo + SL_OSC_HYST_MM) s_feed_auto_x_dir = 1;
                    if (s_feed_auto_x_dir != old_x) s_x_reversal_count++;
                    s_last_step_tick = s_isr_tick;
                    HAL_GPIO_WritePin(X_DIR_GPIO_Port, X_DIR_Pin, s_feed_auto_x_dir > 0 ? GPIO_PIN_SET : GPIO_PIN_RESET);
                    dir_settle_delay();
                    pulse_x_step(s_feed_auto_x_dir);
                }
            } else {
                s_last_step_tick = s_isr_tick;
                HAL_GPIO_WritePin(X_DIR_GPIO_Port, X_DIR_Pin, GPIO_PIN_RESET);
                dir_settle_delay();
                pulse_x_step(-1);
            }
            return;
        }
        if (joy_right()) {
            if (sl_limits_x_taught()) {
                float lo = sl_limits_get_x_min();
                float hi = sl_limits_get_x_max();
                if (lo > hi) { float t = lo; lo = hi; hi = t; }
                if ((hi - lo) < SL_OSC_MIN_RANGE_MM) {
                    s_last_step_tick = s_isr_tick;
                    return;
                }
                if (s_x_passes_requested != 0u && s_x_reversal_count >= 2u * (uint16_t)s_x_passes_requested) {
                    s_last_step_tick = s_isr_tick;
                    return;
                }
                {
                    int old_x = s_feed_auto_x_dir;
                    if (xm >= hi - SL_OSC_HYST_MM) s_feed_auto_x_dir = -1;
                    else if (xm <= lo + SL_OSC_HYST_MM) s_feed_auto_x_dir = 1;
                    if (s_feed_auto_x_dir != old_x) s_x_reversal_count++;
                    s_last_step_tick = s_isr_tick;
                    HAL_GPIO_WritePin(X_DIR_GPIO_Port, X_DIR_Pin, s_feed_auto_x_dir > 0 ? GPIO_PIN_SET : GPIO_PIN_RESET);
                    dir_settle_delay();
                    pulse_x_step(s_feed_auto_x_dir);
                }
            } else {
                s_last_step_tick = s_isr_tick;
                HAL_GPIO_WritePin(X_DIR_GPIO_Port, X_DIR_Pin, GPIO_PIN_SET);
                dir_settle_delay();
                pulse_x_step(1);
            }
            return;
        }
        /* Нейтраль: автоматична подача Z та X між лімітами. Якщо обидві осі навчені — чергуємо кроки. */
        {
            bool do_z = sl_limits_z_taught();
            bool do_x = sl_limits_x_taught();
            if (do_z && do_x)
                do_z = ((s_isr_tick & 1u) != 0u);
            else if (!do_z && !do_x) {
                s_z_reversal_count = 0u;
                s_x_reversal_count = 0u;
                s_last_step_tick = s_isr_tick;
                return;
            }
            if (do_z) {
                float lo = sl_limits_get_z_min();
                float hi = sl_limits_get_z_max();
                if (lo > hi) { float t = lo; lo = hi; hi = t; }
                if ((hi - lo) >= SL_OSC_MIN_RANGE_MM) {
                    if (s_z_passes_requested == 0u || s_z_reversal_count < 2u * (uint16_t)s_z_passes_requested) {
                        int old_z = s_feed_auto_z_dir;
                        if (zm >= hi - SL_OSC_HYST_MM) s_feed_auto_z_dir = -1;
                        else if (zm <= lo + SL_OSC_HYST_MM) s_feed_auto_z_dir = 1;
                        if (s_feed_auto_z_dir != old_z) {
                            s_z_reversal_count++;
                            if (s_z_reversal_count >= 2u && (s_z_reversal_count & 1u) == 0u) {
                                float step_mm = x_step_mm_from_index(s_x_step_per_pass_index);
                                int32_t x_steps = (int32_t)(step_mm * s_steps_per_mm_x + 0.5f);
                                if (x_steps > 0) s_z_pass_x_pending_steps += x_steps;
                            }
                        }
                        s_last_step_tick = s_isr_tick;
                        HAL_GPIO_WritePin(Z_DIR_GPIO_Port, Z_DIR_Pin, s_feed_auto_z_dir > 0 ? GPIO_PIN_SET : GPIO_PIN_RESET);
                        dir_settle_delay();
                        pulse_z_step(s_feed_auto_z_dir);
                        return;
                    }
                }
            } else {
                float lo = sl_limits_get_x_min();
                float hi = sl_limits_get_x_max();
                if (lo > hi) { float t = lo; lo = hi; hi = t; }
                if ((hi - lo) >= SL_OSC_MIN_RANGE_MM) {
                    if (s_x_passes_requested == 0u || s_x_reversal_count < 2u * (uint16_t)s_x_passes_requested) {
                        int old_x = s_feed_auto_x_dir;
                        if (xm >= hi - SL_OSC_HYST_MM) s_feed_auto_x_dir = -1;
                        else if (xm <= lo + SL_OSC_HYST_MM) s_feed_auto_x_dir = 1;
                        if (s_feed_auto_x_dir != old_x) s_x_reversal_count++;
                        s_last_step_tick = s_isr_tick;
                        HAL_GPIO_WritePin(X_DIR_GPIO_Port, X_DIR_Pin, s_feed_auto_x_dir > 0 ? GPIO_PIN_SET : GPIO_PIN_RESET);
                        dir_settle_delay();
                        pulse_x_step(s_feed_auto_x_dir);
                        return;
                    }
                }
            }
        }
        s_z_reversal_count = 0u;
        s_x_reversal_count = 0u;
        s_last_step_tick = s_isr_tick;
        return;
    }

    s_last_step_tick = s_isr_tick;
    if (joy_up()) {
        HAL_GPIO_WritePin(Z_DIR_GPIO_Port, Z_DIR_Pin, GPIO_PIN_SET);
        dir_settle_delay();
        pulse_z_step(1);
        return;
    }
    if (joy_down()) {
        HAL_GPIO_WritePin(Z_DIR_GPIO_Port, Z_DIR_Pin, GPIO_PIN_RESET);
        dir_settle_delay();
        pulse_z_step(-1);
        return;
    }
    if (joy_left()) {
        HAL_GPIO_WritePin(X_DIR_GPIO_Port, X_DIR_Pin, GPIO_PIN_RESET);
        dir_settle_delay();
        pulse_x_step(-1);
        return;
    }
    if (joy_right()) {
        HAL_GPIO_WritePin(X_DIR_GPIO_Port, X_DIR_Pin, GPIO_PIN_SET);
        dir_settle_delay();
        pulse_x_step(1);
    }
}
#else
void jog_get_joy_state(unsigned int *up, unsigned int *down, unsigned int *left, unsigned int *right)
{
    if (up)   *up   = 0u;
    if (down) *down = 0u;
    if (left) *left = 0u;
    if (right) *right = 0u;
}
void jog_get_step_counts(uint32_t *x, uint32_t *z)
{
    if (x) *x = s_step_count_x;
    if (z) *z = s_step_count_z;
}
void jog_get_pos_mm(float *x_mm, float *z_mm)
{
    const axis_cfg_t *cx = system_axis_cfg(AXIS_X);
    const axis_cfg_t *cz = system_axis_cfg(AXIS_Z);
    if (x_mm) *x_mm = (float)s_pos_x_steps / (cx->steps_per_mm > 0.0f ? cx->steps_per_mm : 1.0f);
    if (z_mm) *z_mm = (float)s_pos_z_steps / (cz->steps_per_mm > 0.0f ? cz->steps_per_mm : 1.0f);
}
void jog_get_rapid_state(unsigned int *rapid)
{
    if (rapid) *rapid = 0u;
}
void jog_set_feed_override(uint16_t raw)
{
    s_feed_override_cached = raw;
}
void jog_tick_from_isr(void) { (void)0; }  /* заглушка: джойстик не використовується */
#endif

