alpri0265/STM32F407ZET6-MODUL-1/Src/jog.c
void jog_process(void)
{
    s_manual_mode = 1u;   /* за замовч. джойстик працює; 0 лише для Feed Auto */
    menu_screen_id_t scr = menu_current_screen();

#if JOG_ALWAYS_RUN_TEST
    {
        uint32_t now = s_isr_tick;
        uint32_t period_ms = JOG_STEP_PERIOD_MS;
        if ((now - s_last_step_tick) < period_ms)
            return;
        s_last_step_tick = now;
        static int alt;
        if (alt) {
            HAL_GPIO_WritePin(Z_DIR_GPIO_Port, Z_DIR_Pin, GPIO_PIN_SET);
            dir_settle_delay();
            pulse_z_step(1);
        } else {
            HAL_GPIO_WritePin(X_DIR_GPIO_Port, X_DIR_Pin, GPIO_PIN_SET);
            dir_settle_delay();
            pulse_x_step(1);
        }
        alt = 1 - alt;
        return;
    }
#endif

#if JOG_USE_JOYSTICK
    if (scr == SCREEN_FEED_AUTO) {
        s_manual_mode = 0u;  /* кроки ліміт→ліміт робить TIM6 ISR */
        return;
    }

    /* Jog/Feed/Feed Manual: ISR крокує. Тут лише оновлюємо блокування лімітів. */
    s_manual_mode = 1u;
    {
        float xm, zm;
        jog_get_pos_mm(&xm, &zm);
        uint8_t block = 0u;
        if (sl_limits_x_taught()) {
            float hi = sl_limits_get_x_max();
            float lo = sl_limits_get_x_min();
            if (lo > hi) { float t = lo; lo = hi; hi = t; }
            if (xm <= lo + 0.2f) block |= 0x1u;  /* -X */
            if (xm >= hi - 0.2f) block |= 0x2u;  /* +X */
        }
        if (sl_limits_z_taught()) {
            float hi = sl_limits_get_z_max();
            float lo = sl_limits_get_z_min();
            if (lo > hi) { float t = lo; lo = hi; hi = t; }
            if (zm <= lo + 0.2f) block |= 0x4u;  /* -Z */
            if (zm >= hi - 0.2f) block |= 0x8u;  /* +Z */
        }
        s_limit_block = block;
    }
#else
    /* Режим кнопок меню: Enter перемикає вісь (X/Z), Up = +, Down = −. PB12=Up, PB13=Down, PB14=Enter */
    static int axis_mode; /* 0=X, 1=Z */
    static bool last_ent;
    bool up   = (HAL_GPIO_ReadPin(MPG_A_GPIO_Port, MPG_A_Pin) == GPIO_PIN_RESET);
    bool down = (HAL_GPIO_ReadPin(MPG_B_GPIO_Port, MPG_B_Pin) == GPIO_PIN_RESET);
    bool ent  = (HAL_GPIO_ReadPin(MPG_BTN_GPIO_Port, MPG_BTN_Pin) == GPIO_PIN_SET);

    if (ent && !last_ent) {
        axis_mode = 1 - axis_mode;
        s_last_step_tick = now;
    }
    last_ent = ent;
    if (ent) return;
    if (axis_mode == 0) {
        if (up) {
            HAL_GPIO_WritePin(X_DIR_GPIO_Port, X_DIR_Pin, GPIO_PIN_SET);
            dir_settle_delay();
            pulse_x_step(1);
        } else if (down) {
            HAL_GPIO_WritePin(X_DIR_GPIO_Port, X_DIR_Pin, GPIO_PIN_RESET);
            dir_settle_delay();
            pulse_x_step(-1);
        }
    } else {
        if (up) {
            HAL_GPIO_WritePin(Z_DIR_GPIO_Port, Z_DIR_Pin, GPIO_PIN_SET);
            dir_settle_delay();
            pulse_z_step(1);
        } else if (down) {
            HAL_GPIO_WritePin(Z_DIR_GPIO_Port, Z_DIR_Pin, GPIO_PIN_RESET);
            dir_settle_delay();
            pulse_z_step(-1);
        }
    }
#endif
}

#else
void jog_init(void) {}
void jog_process(void) {}
void jog_get_joy_state(unsigned int *up, unsigned int *down, unsigned int *left, unsigned int *right)
{
    if (up)   *up   = 0u;
    if (down) *down = 0u;
    if (left) *left = 0u;
    if (right) *right = 0u;
}
void jog_get_step_counts(uint32_t *x, uint32_t *z)
{
    if (x) *x = 0u;
    if (z) *z = 0u;
}
void jog_get_pos_mm(float *x_mm, float *z_mm)
{
    if (x_mm) *x_mm = 0.0f;
    if (z_mm) *z_mm = 0.0f;
}
void jog_get_rapid_state(unsigned int *rapid)
{
    if (rapid) *rapid = 0u;
}
void jog_set_feed_override(uint16_t raw) { (void)raw; }
#endif
